domains/mirror/pe/ofTemplates/oldTemplates/RANS_INC/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.10935; 	

boundaryField
{
    "(left|bottom|top|front).*"
    {
        type            fixedValue;
        value		$internalField;
    }

    right 
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
     }
    back
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    carGroup 
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

}
