domains/mirror/pe/ofTemplates/oldTemplates/RANS_INC/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 3.0139; 	
		
boundaryField
{
    "(left|right|bottom|top|front).*"
    {
        type            fixedValue;
        value		uniform 3.0139; 
    }


   back
    {
        type            omegaWallFunction;
        value           $internalField;
    }


   carGroup
    {
        type            omegaWallFunction;
        value           $internalField;
    }

}

